#Database and SQL Final Project

##Name: Lauren Osborn
##Partner Name (Optional): Hanna Osborn

**Make sure to "save" a copy of this file to your own account.**

In this final project, you'll have the chance to design and implement a database using PostgreSQL. You'll be doing the following:


1.	Formulate business rules
2.	Construct an ERD from a set of business rules
3.	Specify the relational schema
4.	Discuss whether this schema meets the 1N, 2N, and 3N normal forms
5.	Create the tables using SQL queries
6.	Run sample SQL queries that demonstrate your ability to
  
  a.	Create table with primary keys and multiple data types

  b.	Join tables with foreign keys

  c.	Insert sample data into tables

  d.	Update existing data in the table

  e.	Delete data from the table
7.	Run sample SQL queries that demonstrate your ability to do the following:

  a.	Simple single table queries

  b.	Single-table queries with WHERE and LIKE

  c.	Single-table queries with aggregate functions

  d.	Single table queries with GROUP BY

  e.	Single-table queries with HAVING

  f.	Subqueries

  g.	Simple multi-table queries with JOIN

  h.	More complex multi-table queries

  i.	The creation of table views
  
  j.	The creation of indexes
8.	Discuss your process of database design and implementation using the Software Development LifeCycle Model 
9.	Do something unique! You could do ONE of the following, or something else:

  a.	Build some indexes and analyze query performance

  b.	Figure out how to add a JSON column, and insert data

  c.	Write a PL/SQL functions or trigger and show how to use it

  d.	Expand the data model to include subtypes and supertypes

  e.	Let your creativity shine!
10.	Save this project as a portfolio-quality work to Github, which you can then share with me (and with future employers, if you would like).

## Grading
The overall project is worth 100 points, with each of the 10 areas above worth 10 points each. 


## Other Guidelines

Here are the guidelines for working on the project:

1. You CAN work with a "team" of up to 3. You should each submit a copy of the work to the D2L dropbox (make sure to include your partner's names!), and each of you should create your own Github account.
2. I encourage you to discuss the project with me (as well as with your peers and tutors). However, my expectation is that the final work done by each team represents their "own" work.

#Load Postgres (Run This Cell)

In [9]:
# Some UNIX utilites we need to install for the lab.
!pip install wget --quiet
!pip install sqlalchemy --quiet
!pip install ipython-sql --quiet

# Install postgresql server
!sudo apt-get -y -qq update
!sudo apt-get -y -qq install postgresql
!pip install pgspecial --quiet

!sudo service postgresql start


# Setup a password `postgres` for username `postgres`
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'postgres';"

# Setup a postgres database with name `my_data` to be used
!sudo -u postgres psql -U postgres -c 'DROP DATABASE IF EXISTS my_data;'

!sudo -u postgres psql -U postgres -c 'CREATE DATABASE my_data;'

# Postgres variables
%env DB_NAME=my_data
%env DB_HOST=localhost
%env DB_PORT=5432
%env DB_USER=postgres
%env DB_PASS=postgres

# Finally, let's make a connnection with the databse
%load_ext sql
%sql postgresql://$DB_USER:$DB_PASS@$DB_HOST/$DB_NAME

  Building wheel for wget (setup.py) ... done
     |████████████████████████████████| 1.6 MB 5.2 MB/s
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76, <> line 10.)
debconf: falling back to frontend: Readline
debconf: unable to initialize frontend: Readline
debconf: (This frontend requires a controlling tty.)
debconf: falling back to frontend: Teletype
dpkg-preconfigure: unable to re-open stdin:
Selecting previously unselected package cron.
(Reading database ... 124013 files and directories currently installed.)
Preparing to unpack .../0-cron_3.0pl1-128.1ubuntu1.2_amd64.deb ...
Unpacking cron (3.0pl1-128.1ubuntu1.2) ...
Selecting previously unselected package logrotate.
Preparing to unpack .../1-logrotate_3.11.0-0.1ubuntu1_amd64.deb ...
Unpacking logrotate (3.11.0-0.1ubuntu1) ...
Selecting previously unselected package netbase.
Preparing to unpack .../2-netbase_5.4_all.deb ...
Unpacking netbase (5.4) ...
Selecting previously unselected package postgresql-client-common.
Preparing to unpack .../3-postgresql-client-common_190ubuntu0.1_all.deb ...
Unpacking postgresql-client-common (190ubuntu0.1) ...
Selecting previously unselected package postgresql-client-10.
Preparing to unpack .../4-postgresql-client-10_10.22-0ubuntu0.18.04.1_amd64.deb ...
Unpacking postgresql-client-10 (10.22-0ubuntu0.18.04.1) ...
Selecting previously unselected package ssl-cert.
Preparing to unpack .../5-ssl-cert_1.0.39_all.deb ...
Unpacking ssl-cert (1.0.39) ...
Selecting previously unselected package postgresql-common.
Preparing to unpack .../6-postgresql-common_190ubuntu0.1_all.deb ...
Adding 'diversion of /usr/bin/pg_config to /usr/bin/pg_config.libpq-dev by postgresql-common'
Unpacking postgresql-common (190ubuntu0.1) ...
Selecting previously unselected package postgresql-10.
Preparing to unpack .../7-postgresql-10_10.22-0ubuntu0.18.04.1_amd64.deb ...
Unpacking postgresql-10 (10.22-0ubuntu0.18.04.1) ...
Selecting previously unselected package postgresql.
Preparing to unpack .../8-postgresql_10+190ubuntu0.1_all.deb ...
Unpacking postgresql (10+190ubuntu0.1) ...
Selecting previously unselected package sysstat.
Preparing to unpack .../9-sysstat_11.6.1-1ubuntu0.2_amd64.deb ...
Unpacking sysstat (11.6.1-1ubuntu0.2) ...
Setting up sysstat (11.6.1-1ubuntu0.2) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline

Creating config file /etc/default/sysstat with new version
update-alternatives: using /usr/bin/sar.sysstat to provide /usr/bin/sar (sar) in auto mode
Created symlink /etc/systemd/system/multi-user.target.wants/sysstat.service → /lib/systemd/system/sysstat.service.
Setting up ssl-cert (1.0.39) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline
Setting up cron (3.0pl1-128.1ubuntu1.2) ...
Adding group `crontab' (GID 110) ...
Done.
Created symlink /etc/systemd/system/multi-user.target.wants/cron.service → /lib/systemd/system/cron.service.
update-rc.d: warning: start and stop actions are no longer supported; falling back to defaults
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up logrotate (3.11.0-0.1ubuntu1) ...
Setting up netbase (5.4) ...
Setting up postgresql-client-common (190ubuntu0.1) ...
Setting up postgresql-common (190ubuntu0.1) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline
Adding user postgres to group ssl-cert

Creating config file /etc/postgresql-common/createcluster.conf with new version
Building PostgreSQL dictionaries from installed myspell/hunspell packages...
Removing obsolete dictionary files:
Created symlink /etc/systemd/system/multi-user.target.wants/postgresql.service → /lib/systemd/system/postgresql.service.
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up postgresql-client-10 (10.22-0ubuntu0.18.04.1) ...
update-alternatives: using /usr/share/postgresql/10/man/man1/psql.1.gz to provide /usr/share/man/man1/psql.1.gz (psql.1.gz) in auto mode
Setting up postgresql-10 (10.22-0ubuntu0.18.04.1) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline
Creating new PostgreSQL cluster 10/main ...
/usr/lib/postgresql/10/bin/initdb -D /var/lib/postgresql/10/main --auth-local peer --auth-host md5
The files belonging to this database system will be owned by user "postgres".
This user must also own the server process.

The database cluster will be initialized with locale "en_US.UTF-8".
The default database encoding has accordingly been set to "UTF8".
The default text search configuration will be set to "english".

Data page checksums are disabled.

fixing permissions on existing directory /var/lib/postgresql/10/main ... ok
creating subdirectories ... ok
selecting default max_connections ... 100
selecting default shared_buffers ... 128MB
selecting default timezone ... Etc/UTC
selecting dynamic shared memory implementation ... posix
creating configuration files ... ok
running bootstrap script ... ok
performing post-bootstrap initialization ... ok
syncing data to disk ... ok

Success. You can now start the database server using:

    /usr/lib/postgresql/10/bin/pg_ctl -D /var/lib/postgresql/10/main -l logfile start

Ver Cluster Port Status Owner    Data directory              Log file
10  main    5432 down   postgres /var/lib/postgresql/10/main /var/log/postgresql/postgresql-10-main.log
update-alternatives: using /usr/share/postgresql/10/man/man1/postmaster.1.gz to provide /usr/share/man/man1/postmaster.1.gz (postmaster.1.gz) in auto mode
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up postgresql (10+190ubuntu0.1) ...
Processing triggers for man-db (2.8.3-2ubuntu0.1) ...
Processing triggers for systemd (237-3ubuntu10.56) ...
     |████████████████████████████████| 165 kB 8.0 MB/s
     |████████████████████████████████| 74 kB 2.3 MB/s
 * Starting PostgreSQL 10 database server
   ...done.
ALTER ROLE
NOTICE:  database "my_data" does not exist, skipping
DROP DATABASE
CREATE DATABASE
env: DB_NAME=my_data
env: DB_HOST=localhost
env: DB_PORT=5432
env: DB_USER=postgres
env: DB_PASS=postgres

'Connected: postgres@my_data'

#Part 1: Scenario Analysis and Business Rule Formulation
For the project, you’ll be creating a mock database for “Monster University,” a school that takes young monsters (dragons, werewolves, cute “ET” style aliens, vampires, ogres, talking apes, robot assassins, and basically anything else you want) and teaches them to be upstanding members of the monster community. The professors are ALSO monsters. Here are the business rules you’ll need to get started:

1.	Your main goal is to represent the Monsters, Classes, and Locations (buildings/rooms) at the school.
2.	Monsters can either teach classes, take classes, or both.
3.	For all Monsters we need to keep track of their 

  a.	name

  b.	species (what kind of monster are they?)

  c.	date of birth

  d.	their diet, if known (herbivore, carnivore, omnivore, “brains”, “electricity”, etc.)

  e. their GPA (between 0 and 4.0)

  f. the number of credits completed.

4.	For classes, we’d like to track the following:

  a.	The title of the class

  b.	The location in which the class is held

  c.	The duration of the class in minutes (between 30 and 180)

  d.  The days on which the class meets (for example "MWF" or "TH").

  e.  The start time of the class 
  
  f.  The instructor of the class (who is a Monster)

  
5. For locations we want to record:

  a. A two-character building code (e.g., "MH" for Memorial Hall).

  b. The room number between 1 and 2000.

  c. The max capacity between 10 and 300.

6. Some Monsters are Alumni, who have graduated from the school. For alumni we also want to record:

  a. the year they graduated, and
  
  b. their degree (computer science, business, English, etc.).

7.	Formulate THREE additional business rules of your choice. Remember, you’ll eventually need to implement these! At least ONE of these rules should involve a new entity, relationship, and/or constraint (as opposed to simply a new attribute).

##Your New Business Rules Here:
1. Students must take at least a class and classes must have at least one student.

2. Student monsters need a grade level.

3. Record of teacher id, and teachers can teach multiple classes.

#Part 2: Conceptual Modeling using Entity-Relationship Diagramming
In this step, I'd like to create an ERD for the business rules above using [Diagrams.net](https://diagrams.net). You should include all entities, attributes, relationships, and cardinalilities. After you have completed this diagram, you should do the following:

1. Export it as "SVG" file in diagrams.net, and save this to your computer.
2. Edit this cell, and select the "Insert Image" button.
3. Select the SVG file you download.
4. NOTE: SVG files will work much better than larger image files (which may cause problems if you try to insert them).

INSERT SVG FILE HERE.![Final_Project.drawio (4).svg]()

#Part 3: Logical Modeling
In this part, I'd like you to map the E-R model you've created to a relational model. This involves creating a relational scheme like the following:


```
table_name_1(attribute1 (PK), attribute2, attribute3)
table_name_2(attribute1 (PK), attribute2, attribute3)

```
You should indicate any **primary keys** by using (PK) and any foreign keys with (FK). For primary keys, you'll need to think about whether you can/should use attributes included in the ER diagram, or whether you might want to to create new attributes to serve as keys.

I recommend creating entities in this order:
1. One table for each "strong" entity in the E-R diagram. Decide on a primary key.
2. Tables for subtypes, if needed.
3. One table for each "weak" entity (besides subtypes) in the E-R diagram. Decide on appropriate primary and foreign keys.
4. Tables needed to model M:N relationships present in the E-R diagram.

**PUT YOUR ANSWER BELOW.**

```
monsters(monster_id (PK), name, species,  dob,  diet, gpa, credits_completed, grade_level)
teachers(teacher_id (PK), monster_id (FK1))
alumnus(alumuni_id (PK), year_graduated, degree, monster_id FK1))
classes(class_id (PK), name, duration,  days_met, start_time, room_id (FK1),  teacher_id (FK2))
locations(room_id (PK), building_code, class_code, max_capacity)
monster2class(id (PK), monster_id (FK1), class_id (FK2))
```

#Part 4: Normalization
Are your relations normalized? Please provide a 2-3 sentence explanation of why/how they meet the following normal forms. Or, if they don't, describe what needs to be done to change them.

1. **First Normal Form.** 

The relations are in first normal form because there are no repeating data groups. Every attribute holds one value only.
2. **Second Normal Form.**

The relations are in second normal form because each attribute functionally depends on a primary key. There are no attributes that partially depend on the primary key. In other words, there are no partial dependencies.
3. **Third Normal Form.** 

The relations are in third normal form because there are no transitive dependencies. No attribute depends on other attributes, since the primary key is adaquete.

**Revised relational scheme (if needed):**
(Your answer here).

#Part 5: Creating Tables
In this part, you'll be creating the tables to store the data about your monstrous students. This involves "mapping" the relational schema to an actual Postgres Databases. Here's what you need to do:

1. CREATE a SQL table for each of the relations you identied in part 4.
2. Make sure all the attribututes are assigned appropriate data types. For example, INTEGER, VARCHAR, or DATE.
3.  Assign appropriate primary keys and foreign keys.

In the starter code below, I've assumed you'll have tables along the line of the following. However, you should feel free to rename, add, or delete tables as needed!

a. Monsters

b. Classes

c. Locations

d. Monster2Class

e. Alumnus

f. Teachers

In [15]:
%%sql 
--If you make mistakes you might need to drop tables and start again
--Here's one way of doing this (run this cell as needed)

 * postgresql://postgres:***@localhost/my_data
(psycopg2.ProgrammingError) can't execute an empty query
[SQL: --If you make mistakes you might need to drop tables and start again
--Here's one way of doing this (run this cell as needed)]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [16]:
%%sql
--Here's the start of one create table statement
--You'll need to create each table individually
--You also need some contraints here!

DROP TABLE IF EXISTS Monsters CASCADE;

CREATE TABLE Monsters(
  monster_id INTEGER PRIMARY KEY,
  name VARCHAR(30) NOT NULL,
  species VARCHAR(15) NOT NULL,
  dob DATE NOT NULL,
  diet VARCHAR(20) NOT NULL,
  gpa NUMERIC(3,2) NOT NULL,
  credits_completed INTEGER NOT NULL,
  grade_level VARCHAR(10)
);

 * postgresql://postgres:***@localhost/my_data
Done.
Done.

[]

In [17]:
%%sql

DROP TABLE IF EXISTS Teachers CASCADE;

CREATE TABLE Teachers(
  teacher_id INTEGER PRIMARY KEY,
  monster_id INTEGER NOT NULL,
  FOREIGN KEY(monster_id) REFERENCES Monsters(monster_id)
);

 * postgresql://postgres:***@localhost/my_data
Done.
Done.

[]

In [18]:
%%sql 

DROP TABLE IF EXISTS Alumnus CASCADE;

CREATE TABLE Alumnus(
  alumini_id INTEGER PRIMARY KEY,
  year_graduated INTEGER NOT NULL,
  degree VARCHAR(50) NOT NULL,
  monster_id INTEGER NOT NULL,
  FOREIGN KEY(monster_id) REFERENCES Monsters(monster_id)
);

 * postgresql://postgres:***@localhost/my_data
Done.
Done.

[]

In [19]:
%%sql 

DROP TABLE IF EXISTS Locations CASCADE;

CREATE TABLE Locations(
  room_id INTEGER PRIMARY KEY,
  building_code VARCHAR(5) NOT NULL,
  class_code INTEGER NOT NULL,
  max_capacity INTEGER NOT NULL
);

 * postgresql://postgres:***@localhost/my_data
Done.
Done.

[]

In [20]:
%%sql

DROP TABLE IF EXISTS Classes CASCADE;

CREATE TABLE Classes(
  class_id INTEGER PRIMARY KEY,
  name VARCHAR(50) NOT NULL,
  duration INTEGER NOT NULL, --MINUTES
  days_met VARCHAR(16) NOT NULL,
  start_time TIME NOT NULL,
  room_id INTEGER NOT NULL,
  FOREIGN KEY(room_id) REFERENCES Locations(room_id)
    ON DELETE CASCADE,
  teacher_id INTEGER NOT NULL,
  FOREIGN KEY(teacher_id) REFERENCES Teachers(teacher_id)
    ON DELETE CASCADE
);

 * postgresql://postgres:***@localhost/my_data
Done.
Done.

[]

In [21]:
%%sql

DROP TABLE IF EXISTS Monster2Class CASCADE;

CREATE TABLE Monster2Class(
  id INTEGER PRIMARY KEY,
  monster_id INTEGER NOT NULL,
  class_id INTEGER NOT NULL,
  FOREIGN KEY(monster_id) REFERENCES Monsters(monster_id)
    ON DELETE CASCADE,
  FOREIGN KEY(class_id) REFERENCES Classes(class_id)
    ON DELETE CASCADE
);

 * postgresql://postgres:***@localhost/my_data
Done.
Done.

[]

#Part 6: Retrieving, Updating, and Deleting Data
In this part, you'll be inserting some data about Monsters, Classes, and Locations.

##6b. Inserting Data
Here are five monsters to insert your database:

1. Cookie Monster (unknown species) was born on Nov 10, 1969. His eats only cookies. He has 3.2 GPA and has completed 76 credits.
2. Marceline (vampire) was born in Feb 3, 1056. She eats "the color red". She is a teacher with a 0.0 GPA and 0 credits completed.
3. Chewbacca (wookie) was born on May 25, 1977. He is an omnivore. He has a 2.6 GPA and has completed 24 credits.
4. Dracula (vampire) was born on Aug 15, 1543. He drinks blood. He has a 4.0 GPA with 112 credits completed. He also teachers classes.
5. Maleficient (dragon) was born on Oct 26, 1856. She is a carnviore. She has a 3.8 GPA with 63 credits completed.
6. Insert at least FOUR more monsters of your choice. At least two of these should have the same species.

Now, show the data in the table.

Here are three locations to insert into your database:
1. CL 101 ("Castle level 1, room 1") holds 100 people.
2. CL 503 ("Castle level 5, room 3") holds 34 people.
3. MU 220 ("Monster Union room 220") holds 12 people.
4. Insert at least TWO more locations into your database. Both should be in the same building. 

Now, show the data in the table.


Here are two classes to insert into your database:
1. Marceline teaches Intro to Guitar on TH from 2 PM to 4 PM in MU 220.
2. Dracula teaches Monster First Aid on MWF from 9 PM to 10 PM in CL 503.
2. Insert at least ONE more class.

Now, show the data in the table.


"ENROLL" some students in your classes.
1. Cookie Monster, Chewbacca, and Maleficient (and perhaps some of the students you added) will take Monster First Aid.
2. Chewbacca and Malificient (and perhaps some of the students you added) will take Intro to Guitar.
3. Enroll some students in your own class!
Now, show the data in the table.


Finally, insert data for at least ONE alumni, and show the results.

In [46]:
%%sql 
-- If you make mistakes, you might need to delete existing data from your tables. 
-- One way you might do this is as follows
-- You might need to include different table names!

DELETE FROM Monsters CASCADE;
DELETE FROM Locations CASCADE;
DELETE FROM Classes CASCADE;
DELETE FROM Alumnus CASCADE;
DELETE FROM Teachers CASCADE;
DELETE FROM Monster2Class CASCADE;

 * postgresql://postgres:***@localhost/my_data
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [47]:
%%sql
--- Insert the data on Monsters. You'll be using statements like the following:
--INSERT INTO Monsters(id, name, ...) VALUES (1, 'Cookie Monster', ...);

INSERT INTO Monsters(monster_id, name, species, dob, diet, gpa, credits_completed, grade_level) VALUES (1, 'Cookie Monster', 'Unkwown', '1969-11-10', 'Cookies', 3.20, 76, 'Junior');
INSERT INTO Monsters(monster_id, name, species, dob, diet, gpa, credits_completed) VALUES (2, 'Marceline', 'Vampire', '1056-02-03', 'Color Red', 0.0, 0);
INSERT INTO Teachers(teacher_id, monster_id) VALUES (1, 2);
INSERT INTO Monsters(monster_id, name, species, dob, diet, gpa, credits_completed, grade_level) VALUES (3, 'Chewbacca', 'Wookie', '1977-5-25', 'Omnivore', 2.6, 24, 'Freshman');
INSERT INTO Monsters(monster_id, name, species, dob, diet, gpa, credits_completed, grade_level) VALUES (4, 'Dracula', 'Vampire', '1543-8-15', 'Blood', 4.0, 112, 'Graduate');
INSERT INTO Teachers(teacher_id, monster_id) VALUES (2, 4);
INSERT INTO Monsters(monster_id, name, species, dob, diet, gpa, credits_completed, grade_level) VALUES (5, 'Maleficient', 'Dragon', '1856-10-26', 'Carnivore', 3.8, 63, 'Sophmore');
INSERT INTO Monsters(monster_id, name, species, dob, diet, gpa, credits_completed, grade_level) VALUES (6, 'Sunflower', 'Unicorn', '1952-10-05', 'Grass', 2.4, 90, 'Senior');
INSERT INTO Monsters(monster_id, name, species, dob, diet, gpa, credits_completed, grade_level) VALUES (7, 'Farkas', 'Werewolf', '1784-12-31', 'Meat', 4.0, 150, 'Graduate');
INSERT INTO Teachers(teacher_id, monster_id) VALUES (3, 7);
INSERT INTO Monsters(monster_id, name, species, dob, diet, gpa, credits_completed, grade_level) VALUES (8, 'Embry', 'Werewolf', '1841-7-23', 'Meat', 4.0, 80, 'Junior');
INSERT INTO Monsters(monster_id, name, species, dob, diet, gpa, credits_completed, grade_level) VALUES (9, 'Pegagus', 'Pegagus', '1540-11-08', 'Fruits', 4.0, 170, 'Graduate');


--When you are done inserting, you should display the data, like so:
--SELECT * FROM Monsters;

 * postgresql://postgres:***@localhost/my_data
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
(psycopg2.ProgrammingError) can't execute an empty query
[SQL: --When you are done inserting, you should display the data, like so:
--SELECT * FROM Monsters;]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [48]:
%%sql
SELECT * FROM Monsters;

 * postgresql://postgres:***@localhost/my_data
9 rows affected.

[(1, 'Cookie Monster', 'Unkwown', datetime.date(1969, 11, 10), 'Cookies', Decimal('3.20'), 76, 'Junior'),
 (2, 'Marceline', 'Vampire', datetime.date(1056, 2, 3), 'Color Red', Decimal('0.00'), 0, None),
 (3, 'Chewbacca', 'Wookie', datetime.date(1977, 5, 25), 'Omnivore', Decimal('2.60'), 24, 'Freshman'),
 (4, 'Dracula', 'Vampire', datetime.date(1543, 8, 15), 'Blood', Decimal('4.00'), 112, 'Graduate'),
 (5, 'Maleficient', 'Dragon', datetime.date(1856, 10, 26), 'Carnivore', Decimal('3.80'), 63, 'Sophmore'),
 (6, 'Sunflower', 'Unicorn', datetime.date(1952, 10, 5), 'Grass', Decimal('2.40'), 90, 'Senior'),
 (7, 'Farkas', 'Werewolf', datetime.date(1784, 12, 31), 'Meat', Decimal('4.00'), 150, 'Graduate'),
 (8, 'Embry', 'Werewolf', datetime.date(1841, 7, 23), 'Meat', Decimal('4.00'), 80, 'Junior'),
 (9, 'Pegagus', 'Pegagus', datetime.date(1540, 11, 8), 'Fruits', Decimal('4.00'), 170, 'Graduate')]

In [49]:
%%sql
SELECT * FROM Teachers;

 * postgresql://postgres:***@localhost/my_data
3 rows affected.

[(1, 2), (2, 4), (3, 7)]

In [50]:
%%sql
--Insert the data on locations, and show the results
INSERT INTO Locations(room_id, building_code, class_code, max_capacity) VALUES (1, 'CL', 101, 100);
INSERT INTO Locations(room_id, building_code, class_code, max_capacity) VALUES (2, 'CL', 503, 34);
INSERT INTO Locations(room_id, building_code, class_code, max_capacity) VALUES (3, 'MU', 220, 12);
INSERT INTO Locations(room_id, building_code, class_code, max_capacity) VALUES (4, 'DU', 201, 120); --DU = Dungeon
INSERT INTO Locations(room_id, building_code, class_code, max_capacity) VALUES (5, 'DU', 410, 10);

 * postgresql://postgres:***@localhost/my_data
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [51]:
%%sql
SELECT * FROM Locations;

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[(1, 'CL', 101, 100),
 (2, 'CL', 503, 34),
 (3, 'MU', 220, 12),
 (4, 'DU', 201, 120),
 (5, 'DU', 410, 10)]

In [52]:
%%sql
--Insert the data on classes, and show the results

INSERT INTO Classes(class_id, name, duration, days_met, start_time, room_id, teacher_id) VALUES (1, 'Intro to Guitar', 120,  'TH', '14:00', 3, 1); --refer to locations table for location  and teachers table for teacher
INSERT INTO Classes(class_id, name, duration, days_met, start_time, room_id, teacher_id) VALUES (2, 'Monster First Aid', 60, 'MWF', '21:00', 2, 2);
INSERT INTO Classes(class_id, name, duration, days_met, start_time, room_id, teacher_id) VALUES (3, 'Monster Magic', 90, 'MTWTHF', '07:00', 5, 3);

 * postgresql://postgres:***@localhost/my_data
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [53]:
%%sql
SELECT * FROM Classes;

 * postgresql://postgres:***@localhost/my_data
3 rows affected.

[(1, 'Intro to Guitar', 120, 'TH', datetime.time(14, 0), 3, 1),
 (2, 'Monster First Aid', 60, 'MWF', datetime.time(21, 0), 2, 2),
 (3, 'Monster Magic', 90, 'MTWTHF', datetime.time(7, 0), 5, 3)]

In [54]:
%%sql
--Insert the alumni data, and show the results
INSERT INTO Alumnus(alumini_id, year_graduated, degree, monster_id) VALUES (1, 1995, 'Monster Magic', 7);

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[]

In [55]:
%%sql
SELECT * FROM Alumnus;

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[(1, 1995, 'Monster Magic', 7)]

In [56]:
%%sql
--Insert the enrollment data, and show the results

INSERT INTO Monster2Class(id, monster_id, class_id) VALUES (1, 1, 2); --refer to Classes table for class name and Monsters table for Monster name
INSERT INTO Monster2Class(id, monster_id, class_id) VALUES (2, 3, 2);
INSERT INTO Monster2Class(id, monster_id, class_id) VALUES (3, 5, 2);
INSERT INTO Monster2Class(id, monster_id, class_id) VALUES (4, 3, 1);
INSERT INTO Monster2Class(id, monster_id, class_id) VALUES (5, 5, 1);
INSERT INTO Monster2Class(id, monster_id, class_id) VALUES (6, 9, 3);
INSERT INTO Monster2Class(id, monster_id, class_id) VALUES (7, 8, 3);
INSERT INTO Monster2Class(id, monster_id, class_id) VALUES (8, 5, 3);
INSERT INTO Monster2Class(id, monster_id, class_id) VALUES (9, 6, 3);
INSERT INTO Monster2Class(id, monster_id, class_id) VALUES (10, 2, 3);

 * postgresql://postgres:***@localhost/my_data
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [57]:
%%sql
SELECT * FROM Monster2Class;

 * postgresql://postgres:***@localhost/my_data
10 rows affected.

[(1, 1, 2),
 (2, 3, 2),
 (3, 5, 2),
 (4, 3, 1),
 (5, 5, 1),
 (6, 9, 3),
 (7, 8, 3),
 (8, 5, 3),
 (9, 6, 3),
 (10, 2, 3)]

#6c: Updating Data
In this section, I'd like you to run the following updates

1. MU 220 has been expanded! It can now hold 25 students, instead of 12.
2. Another semester has passed. Add 12 credits to each student's record.
3. [Another update of your choice--describe here. Monster Magic becaomes an honors class, so  the course name needs to be updated.]

After each update please SELECT from the table to show the results.

In [22]:
%%sql
--Update MU 220 and show results
UPDATE Locations
  SET max_capacity = 25
  WHERE room_id = 3;

 * postgresql://postgres:***@localhost/my_data
0 rows affected.

[]

In [23]:
%%sql
SELECT * FROM Locations;

 * postgresql://postgres:***@localhost/my_data
0 rows affected.

[]

In [24]:
%%sql 
--Update student credits and show results
UPDATE Monsters
  SET credits_completed = credits_completed + 12
  WHERE monster_id = 1;

  UPDATE Monsters
  SET credits_completed = credits_completed + 12
  WHERE monster_id = 2;

UPDATE Monsters
  SET grade_level = 'Freshman'
  WHERE monster_id = 2;

  UPDATE Monsters
  SET credits_completed = credits_completed + 12
  WHERE monster_id = 3;

  UPDATE Monsters
  SET credits_completed = credits_completed + 12
  WHERE monster_id = 4;

  UPDATE Monsters
  SET credits_completed = credits_completed + 12
  WHERE monster_id = 5;

  UPDATE Monsters
  SET credits_completed = credits_completed + 12
  WHERE monster_id = 6;

  UPDATE Monsters
  SET credits_completed = credits_completed + 12
  WHERE monster_id = 7;

  UPDATE Monsters
  SET credits_completed = credits_completed + 12
  WHERE monster_id = 8;

  UPDATE Monsters
  SET credits_completed = credits_completed + 12
  WHERE monster_id = 9;

 * postgresql://postgres:***@localhost/my_data
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [25]:
%%sql
SELECT * FROM Monsters;

 * postgresql://postgres:***@localhost/my_data
0 rows affected.

[]

In [26]:
%%sql 
--An update of your choice and show the results
UPDATE Classes
  SET name = 'Monster Magic Honors'
  WHERE class_id = 3;

 * postgresql://postgres:***@localhost/my_data
0 rows affected.

[]

In [27]:
%%sql
SELECT * FROM Classes;

 * postgresql://postgres:***@localhost/my_data
0 rows affected.

[]

#Part 7: SQL Queries
In this section, you'll be demonstrating your ability to retrieve data from the database you've created using SQL queries.

##7a: Simple Single table queries
Retreive a list of monsters ordered alphabetically by name. Limit your results to 5.

In [29]:
%%sql
-- 7a
SELECT * FROM Monsters
ORDER BY name ASC
LIMIT 5;

 * postgresql://postgres:***@localhost/my_data
0 rows affected.

[]

##7b. Single-table queries with WHERE and LIKE
Retrieve JUST the classes that meet on Wednesday (where Wednesday is the 'W' in strings like 'MWF').

In [30]:
%%sql
-- 7b
SELECT * FROM Classes
WHERE days_met LIKE '%W%';

 * postgresql://postgres:***@localhost/my_data
0 rows affected.

[]

##7c. Single-table queries with aggregate functions
Retrieve the minimum, maximum, and average GPA included in your database. You should label the columns "Min GPA", "Max GPA", and "Avg GPA".

In [31]:
%%sql 
--7c
SELECT MIN(gpa) AS "Min GPA", MAX(gpa) AS "Max GPA", AVG(gpa) AS "Avg GPA" FROM Monsters;

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[(None, None, None)]

##7d. Single table queries with GROUP BY
Retrieve a list of each monster species included in the database, along with a count of how many monsters are members of the species.

In [32]:
%%sql
--7d
SELECT DISTINCT(species), COUNT(species) FROM Monsters
GROUP BY species;

 * postgresql://postgres:***@localhost/my_data
0 rows affected.

[]

##7e. Single-table queries with HAVING
Retrieve a list of the buildings (not rooms!) in your data that have a total capacity of more than 20. (A building's capacity is simply the sum of the capacities of all the classrooms it contains).

In [33]:
%%sql
--7e
SELECT DISTINCT(building_code), SUM(max_capacity) FROM Locations
GROUP BY building_code;

 * postgresql://postgres:***@localhost/my_data
0 rows affected.

[]

##7f. Subqueries
Retrieve a list of monsters names and species, together with a count of how many members of that species are in the database.

In [34]:
%%sql
-- 7f
SELECT b.name, a.species, COUNT(a.species) FROM Monsters a
JOIN Monsters b ON a.species = b.species
GROUP BY a.species, b.name

 * postgresql://postgres:***@localhost/my_data
0 rows affected.

[]

#7g. Simple multi-table queries with JOIN
Retrieve the names and GPAs of students enrolled in Intro to Guitar.

In [35]:
%%sql
-- 7g
SELECT name, gpa FROM Monsters
JOIN Monster2Class ON Monsters.monster_id = Monster2Class.monster_id
WHERE class_id = 1;

 * postgresql://postgres:***@localhost/my_data
0 rows affected.

[]

##7h. More complex multi-table queries
Retrieve the total students taught by each teacher in the database. You should have one row of output for each teacher with their name and the total number of students.

In [36]:
%%sql 
-- 7h
SELECT a.name, COUNT(Monster2Class.class_id) FROM (SELECT Monsters.name, Teachers.teacher_id FROM Monsters
JOIN Teachers ON Monsters.monster_id = Teachers.monster_id
WHERE Teachers.teacher_id != 0
GROUP BY Monsters.name, Teachers.teacher_id)a
JOIN Classes ON Classes.teacher_id = a.teacher_id
JOIN Monster2Class ON Monster2Class.class_id = Classes.class_id
GROUP BY a.name

 * postgresql://postgres:***@localhost/my_data
0 rows affected.

[]

##7i. Creation of Views
Create a VIEW based on a SQL query of your choice. Now "SELECT *" from this view to show the results.

In [43]:
%%sql
-- 7i
DROP MATERIALIZED VIEW IF EXISTS Class_Names;
CREATE MATERIALIZED VIEW Class_Names AS
SELECT name, duration, days_met
FROM Classes;

 * postgresql://postgres:***@localhost/my_data
Done.
0 rows affected.

[]

In [44]:
%%sql
SELECT * FROM Class_Names

 * postgresql://postgres:***@localhost/my_data
0 rows affected.

[]

##7g. Creation of Indexes.
Create an index on the column that contains the Monster's names.

In [45]:
%%sql
-- 7f
DROP INDEX IF EXISTS Monster_Names;
CREATE INDEX Monster_Names ON Monsters(name);

 * postgresql://postgres:***@localhost/my_data
Done.
Done.

[]

#8. Database Design Philosophy
In 150 to 200 words, answer the question **"What are the keys to designing a successful database, and how is this reflected in your own work here?"**

YOUR ANSWER HERE.
-
The very first key in designing a successful database is understanding the purpose of the data and the constraints of that data. For instance, we were able to understand that we were creating a database about Monster School and what constraints and features it showcased based on the business rules. Along with our understanding of that database, organizing the data is important, as it helps us plan how we’ll design the database. It is very important to decide on entities, attributes, tables, table relationships, and primary keys based on the data provided. By using conceptual and logical modeling, we were able to develop, test, and refine until we decided on everything and developed a well-designed database relating to its original purpose. Table relationships are vital, as they explain  the data connection. Our entities held the appropriate attributes for the data and depended on only one primary key in each table. In addition, the normalization rules play a key role in designing this database because it eliminates redundant data and dependencies. With the elimination of these, our developing database turned into a successful database. Lastly, the ability to work collaboratively is important because we can bounce ideas, review our work, and give constructive criticism.

#9. Be Creative!
In 150 to 200 words, tell me about what you've done (or will do, in this section) that goes above and beyond the "requirements" of the assignment. Why did you choose to do this? What did you learn from doing it?

YOUR ANSWER HERE. - I believe building two indexes and analyzing query performance goes above and beyond the “requirements” of this assignment because it was not asked before. I chose to build indexes and analyze query performance because I thought it would be interesting to try it out. Moreover, I find it interesting that future "SELECTS" on indexed columns will be faster while future INSERTS or UPDATES will be slower. I learned that creating a database INDEX on a certain column tells the database to store information on a column. Thus, it makes it easier to retrieve information about the column in the future. To start with building indexes, I followed the example from lecture 12. I searched for a keyword using a number of different strategies. By the end, I was able to see how this increases performance by using the EXPLAIN and ANALYZE. The final queries are an order of magnitude faster than the initial efforts. With this experience, I can understand how building indexes effectively is among the most important things to ensure a good database performance. This section allowed me to figure out how to build indexes and analyze query performance.

(Feel free to add code cells below if needed.)

In [81]:
%%sql
-- Include code, if needed.
SELECT * FROM Monsters;

 * postgresql://postgres:***@localhost/my_data
9 rows affected.

[(1, 'Cookie Monster', 'Unkwown', datetime.date(1969, 11, 10), 'Cookies', Decimal('3.20'), 76, 'Junior'),
 (2, 'Marceline', 'Vampire', datetime.date(1056, 2, 3), 'Color Red', Decimal('0.00'), 0, None),
 (3, 'Chewbacca', 'Wookie', datetime.date(1977, 5, 25), 'Omnivore', Decimal('2.60'), 24, 'Freshman'),
 (4, 'Dracula', 'Vampire', datetime.date(1543, 8, 15), 'Blood', Decimal('4.00'), 112, 'Graduate'),
 (5, 'Maleficient', 'Dragon', datetime.date(1856, 10, 26), 'Carnivore', Decimal('3.80'), 63, 'Sophmore'),
 (6, 'Sunflower', 'Unicorn', datetime.date(1952, 10, 5), 'Grass', Decimal('2.40'), 90, 'Senior'),
 (7, 'Farkas', 'Werewolf', datetime.date(1784, 12, 31), 'Meat', Decimal('4.00'), 150, 'Graduate'),
 (8, 'Embry', 'Werewolf', datetime.date(1841, 7, 23), 'Meat', Decimal('4.00'), 80, 'Junior'),
 (9, 'Pegagus', 'Pegagus', datetime.date(1540, 11, 8), 'Fruits', Decimal('4.00'), 170, 'Graduate')]

In [66]:
%%sql
SELECT * FROM Monsters WHERE  credits_completed :: integer > 75;

 * postgresql://postgres:***@localhost/my_data
6 rows affected.

[(1, 'Cookie Monster', 'Unkwown', datetime.date(1969, 11, 10), 'Cookies', Decimal('3.20'), 76, 'Junior'),
 (4, 'Dracula', 'Vampire', datetime.date(1543, 8, 15), 'Blood', Decimal('4.00'), 112, 'Graduate'),
 (6, 'Sunflower', 'Unicorn', datetime.date(1952, 10, 5), 'Grass', Decimal('2.40'), 90, 'Senior'),
 (7, 'Farkas', 'Werewolf', datetime.date(1784, 12, 31), 'Meat', Decimal('4.00'), 150, 'Graduate'),
 (8, 'Embry', 'Werewolf', datetime.date(1841, 7, 23), 'Meat', Decimal('4.00'), 80, 'Junior'),
 (9, 'Pegagus', 'Pegagus', datetime.date(1540, 11, 8), 'Fruits', Decimal('4.00'), 170, 'Graduate')]

In [110]:
%%sql
EXPLAIN ANALYZE SELECT * FROM Monsters WHERE name LIKE '%Cookie%' AND name LIKE '%Monster%';

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[('Seq Scan on monsters  (cost=0.00..1.14 rows=1 width=246) (actual time=0.013..0.016 rows=1 loops=1)',),
 ("  Filter: (((name)::text ~~ '%Cookie%'::text) AND ((name)::text ~~ '%Monster%'::text))",),
 ('  Rows Removed by Filter: 8',),
 ('Planning time: 0.131 ms',),
 ('Execution time: 0.039 ms',)]

In [104]:
%%sql
EXPLAIN ANALYZE SELECT * FROM Monsters WHERE name LIKE '%Cookie Monster';

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[('Seq Scan on monsters  (cost=0.00..1.11 rows=1 width=246) (actual time=0.012..0.015 rows=1 loops=1)',),
 ("  Filter: ((name)::text ~~ '%Cookie Monster'::text)",),
 ('  Rows Removed by Filter: 8',),
 ('Planning time: 0.130 ms',),
 ('Execution time: 0.035 ms',)]

In [105]:
%%sql
EXPLAIN ANALYZE SELECT * FROM Monsters WHERE name = 'Cookie Monster';

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[('Seq Scan on monsters  (cost=0.00..1.11 rows=1 width=246) (actual time=0.012..0.014 rows=1 loops=1)',),
 ("  Filter: ((name)::text = 'Cookie Monster'::text)",),
 ('  Rows Removed by Filter: 8',),
 ('Planning time: 0.135 ms',),
 ('Execution time: 0.034 ms',)]

In [109]:
%%sql
CREATE INDEX name_dex ON Monsters(name);
EXPLAIN ANALYZE SELECT * FROM Monsters WHERE name = 'Cookie Monster';

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[('Seq Scan on monsters  (cost=0.00..1.11 rows=1 width=246) (actual time=0.012..0.015 rows=1 loops=1)',),
 ("  Filter: ((name)::text = 'Cookie Monster'::text)",),
 ('  Rows Removed by Filter: 8',),
 ('Planning time: 0.120 ms',),
 ('Execution time: 0.034 ms',)]

In [111]:
%%sql
SELECT * FROM Monsters WHERE gpa :: integer > 3.00;

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[(4, 'Dracula', 'Vampire', datetime.date(1543, 8, 15), 'Blood', Decimal('4.00'), 112, 'Graduate'),
 (5, 'Maleficient', 'Dragon', datetime.date(1856, 10, 26), 'Carnivore', Decimal('3.80'), 63, 'Sophmore'),
 (7, 'Farkas', 'Werewolf', datetime.date(1784, 12, 31), 'Meat', Decimal('4.00'), 150, 'Graduate'),
 (8, 'Embry', 'Werewolf', datetime.date(1841, 7, 23), 'Meat', Decimal('4.00'), 80, 'Junior'),
 (9, 'Pegagus', 'Pegagus', datetime.date(1540, 11, 8), 'Fruits', Decimal('4.00'), 170, 'Graduate')]

In [116]:
%%sql
EXPLAIN ANALYZE SELECT * FROM Monsters WHERE species LIKE '%Were%' AND name LIKE '%wolf%';

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[('Seq Scan on monsters  (cost=0.00..1.14 rows=1 width=246) (actual time=0.016..0.017 rows=0 loops=1)',),
 ("  Filter: (((species)::text ~~ '%Were%'::text) AND ((name)::text ~~ '%wolf%'::text))",),
 ('  Rows Removed by Filter: 9',),
 ('Planning time: 0.126 ms',),
 ('Execution time: 0.037 ms',)]

In [122]:
%%sql
EXPLAIN ANALYZE SELECT * FROM Monsters WHERE species LIKE '%Were';

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[('Seq Scan on monsters  (cost=0.00..1.11 rows=1 width=246) (actual time=0.015..0.015 rows=0 loops=1)',),
 ("  Filter: ((species)::text ~~ '%Were'::text)",),
 ('  Rows Removed by Filter: 9',),
 ('Planning time: 0.103 ms',),
 ('Execution time: 0.035 ms',)]

In [125]:
%%sql
EXPLAIN ANALYZE SELECT * FROM Monsters WHERE species = 'Werewolf';

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[('Seq Scan on monsters  (cost=0.00..1.11 rows=1 width=246) (actual time=0.014..0.015 rows=2 loops=1)',),
 ("  Filter: ((species)::text = 'Werewolf'::text)",),
 ('  Rows Removed by Filter: 7',),
 ('Planning time: 0.121 ms',),
 ('Execution time: 0.035 ms',)]

In [132]:
 %%sql
CREATE INDEX species_dex ON Monsters(species);
EXPLAIN ANALYZE SELECT * FROM Monsters WHERE species = 'Werewolf';

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[('Seq Scan on monsters  (cost=0.00..1.11 rows=1 width=246) (actual time=0.013..0.014 rows=2 loops=1)',),
 ("  Filter: ((species)::text = 'Werewolf'::text)",),
 ('  Rows Removed by Filter: 7',),
 ('Planning time: 0.119 ms',),
 ('Execution time: 0.033 ms',)]

#10. Share Work With Me on Github
Finally, I'd like you to share your work with me on Github. If you are interesting in working in computer science or IT, it's good to have a basic understanding of how Github works, as its something like an industry "standard" way of sharing code. 
 
Here's what you need to do:
1. Create an account on https://github.com/ 
2. Create a PUBLIC repository called "database_sql".
3. Save your **completed** lab to this repository. From colab, all you need to do is go to "File: Save a copy in Github."

An in-depth tutorial on using Github is here:
https://docs.github.com/en/get-started/quickstart/hello-world 
The only things you need to worry about are (a) creating an account and (b) creating a repository. We won't be worry about branches, commits, or pulls (though you are free to read up on these!). 

Once you've done this, please write down your:

USERNAME: laurenosborn118

REPOSITORY LINK: https://github.com/laurenosborn118/database_sql.git

And that's it! I've enjoyed having you in class--enjoy the rest of the semster :).

**You should also submit this to the D2L Assignment folder.**